# Concatenating
--------------
- Data may not always come in 1 huge file
    - Example: 5 million row dataset may be broken into, 5 separate datasets. Because Small data sets are Easier to store and share
- May have new data for each day

## 1. Exercise 1: Combine two DataFrames row wise (axis = 0)

In [1]:
import os 
os.chdir("C:\\Users\\Hi\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 Lab Data\\Python")

In [2]:
import pandas as pd

In [3]:
df1 = pd.read_csv("Py_cleaning_pivot_concat1.csv")

In [4]:
df1

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
date       2 non-null object
element    2 non-null object
value      2 non-null int64
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [6]:
df2 = pd.read_csv("Py_cleaning_pivot_concat2.csv")

In [7]:
df2

         date element  value
0  2017-09-16    tmax     32
1  2017-09-16    tmin     17

In [8]:
pd.concat?

In [13]:
pd.concat([df1,df2])

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14
0  2017-09-16    tmax     32
1  2017-09-16    tmin     17

In [14]:
pd.concat([df1,df2],ignore_index=True) # to reset index numbers

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14
2  2017-09-16    tmax     32
3  2017-09-16    tmin     17

# 2. What will happens if number of columns are different?

In [9]:
df3 = pd.DataFrame({"date":[101,102,103],"element":["ram","john","renny"]})

In [10]:
df3

   date element
0   101     ram
1   102    john
2   103   renny

In [11]:
df1

         date element  value
0  2017-09-15    tmax     30
1  2017-09-15    tmin     14

In [12]:
pd.concat([df1,df3])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

         date element  value
0  2017-09-15    tmax   30.0
1  2017-09-15    tmin   14.0
0         101     ram    NaN
1         102    john    NaN
2         103   renny    NaN

> Do you Know, What is the default join argument value ?

In [16]:
pd.concat([df1,df3],join="inner") # only commin columns data

         date element
0  2017-09-15    tmax
1  2017-09-15    tmin
0         101     ram
1         102    john
2         103   renny

## 3. Exercise 2: Combine two DataFrames column wise (axis = 1)

In [21]:
# Import pandas
import pandas as pd
# Read data from csv files
df1 = pd.read_csv('Py_cleaning_pivot_concat3.csv')
df2 = pd.read_csv('Py_cleaning_pivot_concat4.csv')

In [22]:
print("***** 01. Observe first data frame *****")
print(df1)

***** 01. Observe first data frame *****
         date element
0  2017-09-16    tmax
1  2017-09-16    tmin

In [23]:
print("***** 02. Observe second data frame *****")
print(df2)

***** 02. Observe second data frame *****
   value
0     32
1     17

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
date       2 non-null object
element    2 non-null object
dtypes: object(2)
memory usage: 112.0+ bytes

In [25]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
value    2 non-null int64
dtypes: int64(1)
memory usage: 96.0 bytes

In [26]:
print("****** 03. Observe concatenated data frame column wise*******")
concatenated = pd.concat([df1, df2],axis=1)
print(concatenated)

****** 03. Observe concatenated data frame column wise*******
         date element  value
0  2017-09-16    tmax     32
1  2017-09-16    tmin     17

## 4. Concatenating many files
a.	**Glob** module to find any extension files in the **edge node/server hard disk**

b.	You can find all .csv files with '*.csv'

    i.	Ex: emp10.csv, employee.csv…etc
    
c.	All parts with 'emp_*'. 

    i.	Ex: emp_*.csv (emp_03sep2017.csv, emp_04sep2017.csv, emp_05sep2017.csv)

d.	Only one character is changing

    i.	Ex: part?.csv (part1.csv, part2.csv, part3.csv..etc)
    
e.	The? Wildcard represents any 1 character, and the * wildcard represents any number of characters.

## 5. Exercise 3: Concatenating Many Files

In [27]:
# import required packages
import glob
import pandas as pd

In [28]:
print("***** 01. Read all emp_part files from working directory *****")
csv_files = glob.glob('emp_part*.csv')
print(csv_files)

***** 01. Read all emp_part files from working directory *****
['emp_part1.csv', 'emp_part2.csv']

In [29]:
a_df_collection = [] # creating empty list
for csv in csv_files:
    df = pd.read_csv(csv)
    a_df_collection.append(df) # list is storing df items

In [30]:
a_df_collection

[   EMPNO   ENAME       JOB   MGR   HIREDATE   SAL    COMM  DEPTNO
 0   7693   SMITH     CLERK  7902  17-DEC-80   960     NaN      20
 1   7499   ALLEN  SALESMAN  7698  20-FEB-81  1600   300.0      30
 2   7521    WARD  SALESMAN  7698  22-FEB-81  1250   500.0      30
 3   7566   JONES   MANAGER  7839  02-APR-81  2975     NaN      20
 4   7654  MARTIN  SALESMAN  7698  28-SEP-81  1250  1400.0      30,
    EMPNO   ENAME        JOB     MGR   HIREDATE   SAL  COMM  DEPTNO
 0   7698   BLAKE    MANAGER  7839.0  01-MAY-81  2850   NaN      30
 1   7782   CLARK    MANAGER  7839.0  09-JUN-81  2450   NaN      10
 2   7788   SCOTT    ANALYST  7566.0  19-APR-87  3000   NaN      20
 3   7839    KING  PRESIDENT     NaN  17-NOV-81  5000   NaN      10
 4   7844  TURNER   SALESMAN  7698.0  08-SEP-81  1500   0.0      30
 5   7876   ADAMS      CLERK  7788.0  23-MAY-87  1100   NaN      20
 6   7900   JAMES      CLERK  7698.0  03-DEC-81   950   NaN      30
 7   7902    FORD    ANALYST  7566.0  03-DEC-81  3000   NaN      20
 8   7934  MILLER      CLERK  7782.0  23-JAN-82  1300   NaN      10]

In [31]:
final_df = pd.concat(a_df_collection,ignore_index=True)

In [32]:
final_df

    EMPNO   ENAME        JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0    7693   SMITH      CLERK  7902.0  17-DEC-80   960     NaN      20
1    7499   ALLEN   SALESMAN  7698.0  20-FEB-81  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0  22-FEB-81  1250   500.0      30
3    7566   JONES    MANAGER  7839.0  02-APR-81  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  28-SEP-81  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0  01-MAY-81  2850     NaN      30
6    7782   CLARK    MANAGER  7839.0  09-JUN-81  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0  19-APR-87  3000     NaN      20
8    7839    KING  PRESIDENT     NaN  17-NOV-81  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0  08-SEP-81  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0  23-MAY-87  1100     NaN      20
11   7900   JAMES      CLERK  7698.0  03-DEC-81   950     NaN      30
12   7902    FORD    ANALYST  7566.0  03-DEC-81  3000     NaN      20
13   7934  MILLER      CLERK  7782.0  23-JAN-82  1300     NaN      10